<?php

return [

    'feature_type' => [
        'basic' => 'اساسي',
        'pro' => 'خاص',
    ],

    'plan_type' => [
        'basic' => 'اساسي',
        'pro' => 'خاص',
        'customized' => 'مخصص'
    ],

    'subscription_status' => [
        'active' => 'نشط',
        'expired' => 'منتهي',
        'freetrial' => 'تجربة مجانية' ,
        'pending' => 'قيد الانتظار',
        'deactivated' => 'معطل',
    ],

    'billing_cycle' => [
        'yearly' => 'سنوي',
        'monthly' => 'شهري',
        'quarterly' => 'ربع سنوي'
    ],

    'selling_system' => [
        'ca' => [
            'label' => 'البيع بالأقسام',
            'description' => 'بيع المحتوى التعليمي حسب القسم، مع إتاحة جميع الكورسات الموجودة داخله للطالب',
        ],
        'co' => [
            'label' => 'البيع بالكورس',
            'description' => 'بيع كل كورس بشكل منفصل مع تحكم كامل في السعر والصلاحيات',
        ],
        's' => [
            'label' => 'البيع بالحصة / الجلسة',
            'description' => 'بيع الحصص أو الجلسات التعليمية بشكل منفصل، سواء كانت مباشرة أو مسجلة',
        ],
        'ss' => [
            'label' => 'الاشتراكات',
            'description' => 'نظام اشتراكات يتيح للطلاب الوصول إلى المحتوى لفترة زمنية محددة',
        ],
    ]
];
